Repository: daeyunkwon/ToDoMeong
Catalog: ToDoMeong/Resource/Localizable.xcstrings
Source language: en
Languages: ja, ko

source: Add
ja: 追加
ko: 추가하기

# addNewTodo
source: Add a New Todo
ja: 新しいタスクを追加
ko: 새로운 할 일 추가

# addNewTodoMessage
source: A new challenge has come up! 🐾
ja: 新しい挑戦がやってきました！🐾
ko: 새로운 도전이 생겼어요! 🐾

source: Add Photo
ja: 写真を追加
ko: 사진 추가하기

source: + Add Todo
ja: + やることを追加
ko: + 할 일 추가하기

# alert.button.close
source: Close
ja: 閉じる
ko: 닫기

# alert.button.go_to_system
source: Open Settings
ja: 設定へ移動
ko: 설정으로 이동

# alert.button.goToAppStore
source: Go to the App Store
ja: App Storeで開く
ko: 앱스토어로 이동

# alert.message.mailNotConfigured
source: The Mail app is not set up on your device, so you can’t send an email. Please contact us directly at sweet_ray@naver.com , or leave your inquiry in the App Store review section and we’ll get back to you as soon as possible. 🙇‍♂️
ja: メールアプリにアカウントが設定されていないため、メールを送信できません。 sweet_ray@naver.com まで直接お問い合わせいただくか、App Storeのレビュー欄にご記入ください。確認後、返信いたします。🙇‍♂️
ko: 메일 앱에 계정이 설정되어 있지 않아 메일을 보낼 수 없습니다. sweet_ray@naver.com 으로 직접 문의해주시거나, 앱스토어 리뷰를 통해 남겨주시면 확인 후 답변드리겠습니다.🙇‍♂️

# alert.message.permission.local_noti
source: We need your notification permission 📩 Turn it on in Settings to receive timely updates.
ja: 通知の許可が必要です 📩 設定からオンにすると、タイムリーにお知らせできます。
ko: 알림이 비활성화되어 있습니다. 📩 설정에서 알림을 켜고 편리하게 이용하세요!

# alert.title.info
source: System Alert
ja: システム通知
ko: 시스템 알림

source: App Version
ja: アプリバージョン
ko: 앱 버전

# calendarTitle
source: Calendar
ja: カレンダー
ko: 캘린더

source: Contact Us
ja: お問い合わせ
ko: 문의하기

source: Dark Mode
ja: ダークモード
ko: 다크 모드

source: Delete
ja: 削除
ko: 삭제

source: Display Theme
ja: 画面テーマ
ko: 화면 테마

source: Edit Existing Todo
ja: 既存のTodoを編集
ko: 기존 할 일 수정

# editTodoMessage
source: Update completed! Shall we run with the changes? 🚀
ja: アップデートが完了しました！修正した通りに進んでみましょうか？🚀
ko: 업데이트 완료! 수정한 대로 달려볼까요? 🚀

# emptyTodoMessageForToday
source: What tasks do you need to do today? Try adding a new todo🐾
ja: 今日は何をする必要がありますか? 新しいタスクを追加してみてください🐾
ko: 오늘은 어떤 일을 해야 하나요? 새로운 할 일을 추가해 보세요🐾

# failedToAddMessage
source: Adding a new Todo has failed. Please try again later.
ja: 新しいTodoの追加に失敗しました。 後で再試行してください。
ko: 새로운 할 일 추가가 실패되었습니다. 잠시 후 다시 시도해 주세요.

# failedToDeleteMessage
source: Deletion has failed. Please try again later.
ja: 削除に失敗しました。 後で再試行してください。
ko: 삭제가 실패되었습니다. 잠시 후 다시 시도해 주세요.

# failedToEditMessage
source: The edit has failed. Please try again later.
ja: 編集に失敗しました。 後で再試行してください。
ko: 수정이 실패되었습니다. 잠시 후 다시 시도해 주세요.

# failedToLoadMessage
source: Failed to load the saved Todo list. Please try again later.
ja: 保存されたTodoリストの読み込みに失敗しました。 後で再試行してください。
ko: 저장된 할 일 목록 불러오기가 실패되었습니다. 잠시 후 다시 시도해 주세요.

source: Issue Occurred
ja: 問題が発生しました
ko: 문제 발생

source: Light Mode
ja: ライトモード
ko: 라이트 모드

# localAlarm
source: Notifications
ja: 通知
ko: 알림

# localAlarm.noti.body
source: It's already time for the notification we promised 🙌 Have a great day today🐾
ja: もうすぐお知らせをお届けする時間になりました🙌 今日も一日、がんばってください🐾
ko: 벌써 알림을 보내드리기로 약속한 시간이 되었어요🙌 오늘 하루도 힘내세요🐾

# localAlarm.noti.title
source: Shall we check today’s tasks?
ja: 今日のやることを確認してみましょう！
ko: 오늘 할 일 확인해 볼까요?

# localAlarm.setting.infoMessage
source: Notifications will reach you daily at your chosen time 🐾
ja: 毎日、設定した時間に通知をお届けしますよ🐾
ko: 매일 설정한 시간에 알림을 드릴게요🐾

# localAlarm.setting.save.title
source: Time Setting
ja: 時間設定
ko: 시간 설정하기

# localAlarm.setting.title
source: Notification Settings
ja: 通知設定
ko: 알림 설정

# noTaskMessageForCalendar
source: There are no tasks for the selected day. Try adding a new task! 🐾
ja: 選択した日にはタスクがありません。 新しいタスクを追加してみてください！🐾"
ko: 선택한 날에는 할 일이 없어요. 새로운 할 일을 추가해 보세요🐾

source: Open Source License
ja: オープンソースライセンス
ko: 오픈소스 라이선스

# photoDetail
source: Photo Details
ja: 写真の詳細
ko: 사진 상세보기

source: Remove Photo
ja: 写真を削除
ko: 사진 제거하기

source: Save
ja: 保存
ko: 저장

# setting
source: Settings
ja: 設定
ko: 설정

source: System Settings
ja: システム設定
ko: 시스템 설정

# textFieldPlaceholder
source: Please enter the content
ja: 内容を入力してください
ko: 내용을 입력해 주세요

source: Today
ja: 今日
ko: 오늘

# todayTodo
source: Today's Todo
ja: 今日のタスク
ko: 오늘 할 일

source: Todo
ja: やること
ko: 할 일

# widget.title.today
source: Today's Tasks
ja: 今日のタスク
ko: 오늘의 할 일

source: Contact ToDoMeong
ko: 투두멍 문의하기
